##SQL  
[colab](https://colab.research.google.com/drive/1moAnfnp4RKOXBPyk_kZ8ScdzHC8wn704?usp=sharing)

### Введение в SQL Sub-Queries

In [1]:
# Создаем Таблицу
import sqlite3

conn = sqlite3.connect('dz.db')
print("Opened database successfully");

conn.execute('''
CREATE TABLE IF NOT EXISTS team_data(
                      team text, 
                      country text, 
                      season integer, 
                      total_goals integer);''')

conn.commit()

print("Table created successfully");

#conn.close()

Opened database successfully
Table created successfully

In [2]:
conn = sqlite3.connect('dz.db')

conn.execute('''
CREATE TABLE IF NOT EXISTS team_players(
                      team text, 
                      country text, 
                      player text, 
                      goals integer);''')

conn.commit()

In [3]:
# Добавляем значения

conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2019, 53);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2019, 47);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2019, 52);")
conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2018, 49);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2018, 45);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2018, 50 );")


conn.execute("INSERT INTO team_players VALUES('Real Madrid', 'Spain', 'Huan', 10);")
conn.execute("INSERT INTO team_players VALUES('Barcelona', 'Spain', 'Honsales', 10);")
conn.execute("INSERT INTO team_players VALUES('Arsenal', 'UK', 'Bernd Leno', 5);")
conn.execute("INSERT INTO team_players VALUES('Real Madrid', 'Eder Militan', 2018, 4);")
conn.execute("INSERT INTO team_players VALUES('Barcelona', 'Spain', 'Nelsen Semedu', 4);")
conn.execute("INSERT INTO team_players VALUES('Arsenal', 'UK', 'Rob Holding', 5 );")

conn.commit()

In [4]:
#Представления

cur = conn.execute("SELECT goals, team FROM team_players;")

cur.fetchall()

[(10, 'Real Madrid'),
 (10, 'Barcelona'),
 (5, 'Arsenal'),
 (4, 'Real Madrid'),
 (4, 'Barcelona'),
 (5, 'Arsenal')]

In [5]:
#Выборки

cur = conn.execute("SELECT total_goals, team FROM team_data WHERE country != 'UK' OR total_goals> 50 ;")

cur.fetchall()

[(53, 'Real Madrid'),
 (47, 'Barcelona'),
 (52, 'Arsenal'),
 (49, 'Real Madrid'),
 (45, 'Barcelona')]

In [6]:
# Вычисляем среднее

conn = sqlite3.connect('dz.db')

cursor = conn.execute(''' SELECT team,country,
                            AVG(total_goals) AS avg_goals
                          FROM team_data
                          GROUP BY team;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 'UK', 51.0)
('Barcelona', 'Spain', 46.0)
('Real Madrid', 'Spain', 51.0)

In [7]:
# Неправильный запрос

conn = sqlite3.connect('dz.db')

cursor = conn.execute(''' SELECT team AS team_name ,
                            AVG(total_goals) AS avg_goals
                          FROM team_data                          
                          GROUP BY team
                          HAVING avg_goals > 50;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)
('Real Madrid', 51.0)

In [8]:
# Правильный запрос

conn = sqlite3.connect('dz.db')

cursor = conn.execute(''' SELECT team_name, avg_goals
                          FROM (

                          -- Here we make our sub-query:
                            SELECT team AS team_name,
                            AVG(total_goals) AS avg_goals
                            FROM team_data
                            GROUP BY team) tp
                          -- End of the sub-query
                          
                          WHERE avg_goals > 50;''')

for row in cursor:
  print(row)
conn.close()

('Arsenal', 51.0)
('Real Madrid', 51.0)

In [9]:
#Joins

conn = sqlite3.connect('dz.db')

cursor = conn.execute(''' SELECT team_data.team,team_data.country,player,total_goals, goals
                          
                          FROM team_data
                          INNER JOIN team_players on team_data.team = team_players.team;''')

cursor.fetchall()

[('Real Madrid', 'Spain', '2018', 53, 4),
 ('Real Madrid', 'Spain', 'Huan', 53, 10),
 ('Barcelona', 'Spain', 'Honsales', 47, 10),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 47, 4),
 ('Arsenal', 'UK', 'Bernd Leno', 52, 5),
 ('Arsenal', 'UK', 'Rob Holding', 52, 5),
 ('Real Madrid', 'Spain', '2018', 49, 4),
 ('Real Madrid', 'Spain', 'Huan', 49, 10),
 ('Barcelona', 'Spain', 'Honsales', 45, 10),
 ('Barcelona', 'Spain', 'Nelsen Semedu', 45, 4),
 ('Arsenal', 'UK', 'Bernd Leno', 50, 5),
 ('Arsenal', 'UK', 'Rob Holding', 50, 5)]

In [10]:
conn.close()

# SQL Programming - Основы с magic командами

## 1.2 Подключение к базе

In [11]:
# Загружаем sql extension

%load_ext sql


#
%sql sqlite:////content/dz.db

'Connected: @/content/dz.db'

## 1.3 Создание таблицы

In [12]:
# Пример 1
#
%%sql 
CREATE TABLE if not exists Classmates (
    PersonID, 
    LastName, 
    FirstName, 
    Phone, 
    Residence
);

 * sqlite:////content/dz.db
Done.

[]

In [13]:
# Пример  2

%%sql
CREATE TABLE if not exists Customers(
   Id,   
   Name,  
   Age,
   Address,  
   Salary
);

SELECT * From Customers;

 * sqlite:////content/dz.db
Done.
Done.

[]

In [14]:
# Пример 3
%%sql
CREATE TABLE if not exists Students(
    AdmissionsNo,
    FirstName,
    MiddleName,
    LastName,
    DateOfBirth,
    DateOfAdmission
);
 
SELECT * from Students;

 * sqlite:////content/dz.db
Done.
Done.

[]

### <font color="green"> 1.3 ДЗ </font>

In [15]:
# Задача 1
# Давайте создадим таблицу с именем PC со следующими полями;
# code, model, speed, RAM, HD, CD и цена.
# Мы также указываем соответствующие типы данных для нашей таблицы, добавляем туда произвольные данные и отображаем ее.
%%sql 
 CREATE TABLE if not exists PC(
  code int, 
  model varchar(50), 
  speed float, 
  RAM int, 
  HD varchar(50), 
  CD varchar(50),
  price float
);

insert into PC(code, model, speed, RAM, HD, CD, price) values (128,'model1',133.5, 1024, 'SSD','NOCD',12345.67);
insert into PC values(129,'model2',133.5, 2046, 'SSD','NOCD',8345.67);
insert into PC values(1287,'model31',133.5, 0, 'hdD','CD2',22745.67);
insert into PC values(1282,'model2',13.5, 1024, 'HD','NOCD',1245.67);
insert into PC values(1286,'model4',143.5, 4048, 'SSD','CD1',122345.67);
insert into PC values(1281,'model5',133.7, 1024, 'SSD','NOCD',145.67);

SELECT * from PC;

 * sqlite:////content/dz.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(128, 'model1', 133.5, 1024, 'SSD', 'NOCD', 12345.67),
 (129, 'model2', 133.5, 2046, 'SSD', 'NOCD', 8345.67),
 (1287, 'model31', 133.5, 0, 'hdD', 'CD2', 22745.67),
 (1282, 'model2', 13.5, 1024, 'HD', 'NOCD', 1245.67),
 (1286, 'model4', 143.5, 4048, 'SSD', 'CD1', 122345.67),
 (1281, 'model5', 133.7, 1024, 'SSD', 'NOCD', 145.67)]

In [16]:
# Задача 2
# Давайте создадим таблицу с именем PC со следующими полями;
# code, model, speed, type and Price.
# Мы также указываем соответствующие типы данных для нашей таблицы, добавляем туда произвольные данные и отображаем ее.

%%sql
CREATE TABLE if not exists Printer(
  code int, 
  model varchar(50), 
  speed float, 
  type boolean,
  price float
);

insert into Printer values(128,'model1',15.7,1, 1345.67);
insert into Printer values(18,'model2',15.7,0, 1235.67);
insert into Printer values(28,'model3',12,1, 1234);
insert into Printer values(11,'model3',152.7,1, 1115.67);
insert into Printer values(18,'model1',157.7,0, 12345.67);


SELECT * from Printer;

 * sqlite:////content/dz.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(128, 'model1', 15.7, 1, 1345.67),
 (18, 'model2', 15.7, 0, 1235.67),
 (28, 'model3', 12.0, 1, 1234.0),
 (11, 'model3', 152.7, 1, 1115.67),
 (18, 'model1', 157.7, 0, 12345.67)]

## 1.4 Устанавливаем типы данных для столбцов

In [17]:
# Пример 1
#integer, text, varchar,date,float
%%sql
CREATE TABLE IF NOT EXISTS Citizens (
    NationalID int,
    FirstName varchar(255),
    MiddleName varchar(255),
    PostalAddress varchar(255),
    Residence varchar(255));
SELECT * from Citizens;

 * sqlite:////content/dz.db
Done.
Done.

[]

In [18]:
# Пример 2

%%sql
CREATE TABLE IF NOT EXISTS artists(
    Artist_Id int,
    Artist_Name varchar(60),
    Artist_DOB date,
    Posters_In_Stock boolean);

SELECT * from artists;

 * sqlite:////content/dz.db
Done.
Done.

[]

In [19]:
# Пример  3

%%sql
CREATE TABLE IF NOT EXISTS Players (
    id int,
    name text,
    age integer,
    height float);

SELECT * from Players;

 * sqlite:////content/dz.db
Done.
Done.

[]

### <font color="green"> 1.4 ДЗ</font>

In [20]:
# Задача 1
# Давайте создадим таблицу customer с CustID с типом данных Integer, LastName
# с varchar длиной 25 символов, FirstName с varchar длиной 20 символов
#
%%sql
CREATE TABLE IF NOT EXISTS CUSTOMER(
  CustID Integer,
  LastName varchar(25),
  FirstName varchar(20)
 );
SELECT * from CUSTOMER;

 * sqlite:////content/dz.db
Done.
Done.

[]

In [21]:
# Задание 3
# Создайте таблицу с названием sales, в которой хранятся идентификатор продажи, идентификатор клиента, имя и адрес.
# используя также соответствующие типы данных
# 
%%sql
CREATE TABLE IF NOT EXISTS SALES(
    SalesID integer,
    CustomerID int,
    Name text,
    Address varchar
);
SELECT * from SALES;

 * sqlite:////content/dz.db
Done.
Done.

[]

In [22]:
# Задание 4
# Создайте таблицу с именем сотрудники, в которой хранятся номер сотрудника, имя сотрудника,
# отдел и информацию о зарплате с использованием соответствующих типов данных
#
%%sql
CREATE TABLE IF NOT EXISTS EMPLOYEES(
    CustomerID int,
    Name varchar(50),
    department varchar(50),
    salary float
    
);
SELECT* from EMPLOYEES;

 * sqlite:////content/dz.db
Done.
Done.

[]

## 1.5 Устанавливаем Default Values для столбцов

In [23]:
# Пример  2
# 
%%sql
CREATE TABLE IF NOT EXISTS TeamMembers (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER DEFAULT 'test',
    height REAL);

 * sqlite:////content/dz.db
Done.

[]

### <font color="green"> 1.5 ДЗ</font>

In [24]:
# Задача 1
# Давайте создадим новую таблицу с именем latest_players с полями, похожими на
# уже созданная таблица Players, но укажите значение по умолчанию unknown
#
%%sql
CREATE TABLE IF NOT EXISTS latest_players(
    id int,
    name text,
    age integer DEFAULT 'unknown',
    height float
    );  
insert into latest_players(id,name,height) values(1,"nnn",170);

Select * from latest_players;

 * sqlite:////content/dz.db
Done.
1 rows affected.
Done.

[(1, 'nnn', 'unknown', 170.0)]

In [25]:
# Задача 2
# Давайте создадим новую таблицу с названиями ресторанов с полями
# - имя: varchar
# - описание: text
# - адрес: строка, значение по умолчанию 'Moscow'
# - user_id: integer
# - last_orders_at: date
# При необходимости мы можем провести внешнее исследование типа данных.
#
%%sql
CREATE TABLE IF NOT EXISTS restaurants(
  name varchar,
  description text,
  address varchar(50) default 'Moscow',
  user_id integer,
  last_orders_at date
);

 * sqlite:////content/dz.db
Done.

[]

## 1.6 Изменение SQL таблиц

In [26]:
# Пример 1
%%sql 
ALTER TABLE Classmates ADD Gender;
 
SELECT * FROM Classmates;

 * sqlite:////content/dz.db
Done.
Done.

[]

In [27]:
# Пример 2
#
%%sql 
--ALTER TABLE Classmates DROP COLUMN Residence;

 * sqlite:////content/dz.db
0 rows affected.

[]

In [28]:
# Пример 3

%%sql  
ALTER TABLE Classmates RENAME TO Schoolmates;

 * sqlite:////content/dz.db
Done.

[]

### <font color="green"> 1.6 ДЗ</font>

In [29]:
# Задача 1
# Добавьте столбец DOB с типом данных DATE в таблицу TeamMembers с помощью;
# Подсказка: тип данных идет после имени столбца
%%sql 
ALTER TABLE TeamMembers add DOB date;

SELECT *FROM TeamMembers;

 * sqlite:////content/dz.db
Done.
Done.

[]

In [30]:
# Давайте проверим наш тип данных
%%sql
PRAGMA table_info(TeamMembers);

 * sqlite:////content/dz.db
Done.

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'name', 'TEXT', 0, None, 0),
 (2, 'age', 'INTEGER', 0, "'test'", 0),
 (3, 'height', 'REAL', 0, None, 0),
 (4, 'DOB', 'date', 0, None, 0)]

In [31]:
# Задача 2
# Давайте теперь добавим столбец STUDIO с типом данных TEXT в таблицу Artists
#
%%sql
ALTER TABLE Artists add STUDIO TEXT;

SELECT *FROM Artists;

 * sqlite:////content/dz.db
Done.
Done.

[]

In [32]:
# Задание 3
# Затем мы переименовываем таблицу Artists в Music Artists
#
%%sql
ALTER TABLE Artists RENAME TO MusicArtists;

 * sqlite:////content/dz.db
Done.

[]

## 1.7 Удаление SQL Таблиц

### 1.71 Очистка таблицы

In [33]:
# Пример  1

#
%%sql
--TRUNCATE TABLE Schoolmates;

 * sqlite:////content/dz.db
0 rows affected.

[]

### 1.72 Удаление таблицы

In [34]:
# Пример 1
%sql DROP TABLE Schoolmates;

 * sqlite:////content/dz.db
Done.

[]

### <font color="green"> 1.7 ДЗ</font>

In [35]:
# Задача 1
# Давайте удалим таблицу Players из нашей базы данных
#
%%sql 
DROP TABLE Players;

 * sqlite:////content/dz.db
Done.

[]

In [36]:
# Задача 2
# Давайте удалим таблицу Customers из нашей базы данных
#
%%sql
drop table Customers;

 * sqlite:////content/dz.db
Done.

[]

In [37]:
# Задание 3
# И, наконец, очистить и удалить нашу таблицу Artists из нашей базы данных
#
%%sql
delete from MusicArtists;
drop table MusicArtists;

 * sqlite:////content/dz.db
0 rows affected.
Done.

[]

## Чтение данных из таблицы с помощью Pandas

In [38]:
import pandas as pd
import sqlite3

con = sqlite3.connect("dz.db")

# Load the data into a DataFrame
surveys_df = pd.read_sql_query("SELECT * from team_data", con)

# Select only data for 2002
#surveys2002 = surveys_df[surveys_df.year == 2002]

# Write the new DataFrame to a new SQLite table
#surveys2002.to_sql("surveys2002", con, if_exists="replace")

con.close()

In [39]:
surveys_df.head()

          team country  season  total_goals
0  Real Madrid   Spain    2019           53
1    Barcelona   Spain    2019           47
2      Arsenal      UK    2019           52
3  Real Madrid   Spain    2018           49
4    Barcelona   Spain    2018           45